{ config, pkgs, ... }:

{
  # ==================================================
  # 导入 Home Manager 模块
  # ==================================================
  imports = [
    ../default.nix
  ];

  # ==================================================
  # 用户信息
  # ==================================================
  home.username = "wang";
  home.homeDirectory = "/home/wang";

  # Home Manager 状态版本（非常重要，不要随便改）
  home.stateVersion = "26.05";

  # ==================================================
  # Git
  # ==================================================
  programs.git = {
    enable = true;
    settings = {
      user = {
        name  = "wang";
        email = "1442104999@qq.com";
      };
    };
  };

  # ==================================================
  # 用户软件
  # ==================================================
  home.packages = with pkgs; [
    google-chrome
    doublecmd
    kdePackages.dolphin
  ];
}
